globals.showTranslit =  ''


function localInitialise () {

	}


_characterSet = 
"क ख ग घ ङ च छ ज झ ञ ट ठ ड ढ ण त थ द ध न प फ ब भ म य र ल व श ष स ह ् क़ ख़ ग़ ऩ ड़ ढ़ ऱ य़ ळ ऴ फ़ ज़ ऄ अ आ इ ई उ ऊ ऋ ऍ ऎ ए ऐ ऑ ऒ ओ औ ा ि ी ु ू ृ ॅ ॆ े ै ॉ ॊ ो ौ ँ ं ः ़ ॑ ॒ ॓ ॔ ० १ २ ३ ४ ५ ६ ७ ८ ९ ₹ । ॥ ॰ ॐ ऽ ॻ ॼ ॽ ॾ ॿ ॠ ऌ ॡ ॄ ॢ ॣ"


var _h = {
'974': ['973', '93B', '93A', '93E', '93B'],
'973': ['93B', '93A', '93E', '93B', '974'],
'93B': ['93A', '93E', '93B', '974', '973'],
'93A': ['93E', '93B', '974', '973', '93B'],
'93E': ['93B', '974', '973', '93B', '93A'],
'93B': ['974', '973', '93B', '93A', '93E'],
'908': ['919', '939', '907'],
'919': ['939', '907', '908'],
'939': ['907', '908', '919'],
'907': ['908', '919', '939'],
'946': ['947', '94A', '94B', '90E'],
'947': ['94A', '94B', '90E', '946'],
'94A': ['94B', '90E', '946', '947'],
'94B': ['90E', '946', '947', '94A'],
'90E': ['946', '947', '94A', '94B'],
'92B': ['915'],
'915': ['92B'],
'92A': ['925', '92F'],
'925': ['92F', '92A'],
'92F': ['92A', '925'],
'938': ['92E'],
'92E': ['938'],
'92C': ['937', '935'],
'937': ['935', '92C'],
'935': ['92C', '937'],

end: {}
}


var keyboarddef = [
"§ ॊ ऒ|1 १ ऍ|2 २ ॅ ऽ|3 ३ ्र|4 ४ र् ₹|5 ५ ज्ञ|6 ६ त्र|7 ७ क्ष|8 ८ श्र|9 ९ (|0 ० ) ॰|- ः ॢ|= ृ ऋ ॄ",
"q ौ औ|w ै ऐ|e ा आ|r ी ई|t ू ऊ|y ब भ|u ह ङ|i ग घ ग़|o द ध|p ज झ ज़|[ ड ढ ड़|] ़ ञ",
"a ो ओ|s े ए|d ् अ|f ि इ|g ु उ|h प फ|j र ऱ|k क ख क़|l त थ|; च छ|' ट ठ ॑|\\ ॉ ऑ",
"` ॊ ऒ `|z ॆ ऎ|x ं ँ ॐ|c म ण|v न ऩ|b व ऴ|n ल ळ ऌ|m स श|,  ष|. । ॥|/ य य़"
]


var justLatinMap = `
a ā â æ aʲ aʷ aː
A ạ ạʲ ạʷ ạ̄ ậ ɒ
b bʰ ɓ
c cʰ ɕ
d dʰ ɖ ɗ
e ē ê ə
E ẹ ẹ̄ ệ
f f̣
g gʰ ɠ
h h̽ ḥ
i ī iː
I ị ị̄
j jʰ ɟ
k kʰ
l l̥ l̥̄ l̥̣ l̥̣̄ ɭ ɭʱä ɭ̆
m m̽
n ṉ ŋ ɲ ɳ ŋ̽
o ō ô
O ọ ọ̄ ộ
p pʰ
q q̣
r ɾ ɾʰ ɾ̣ ɾ̣ʰ ɾʱ
R r̥ r̥̄ r̥̣ r̥̣̄
s ʂ ʃ ʄ
t tʰ ʈ ʈʰ ʧ
u ū uː
U ụ ụ̄
v ʋ ʌ
x x̣
y ẏ ỵ̇ ɣ ɣ̣
z ẓ ʒ ʒ̣
[ ¶ ’
: ː
/ ˑ
* ͓
`



/*var translitCharacterMap = `
a ā ा
A ạ अ ạ̄ आ
b b ब
B bʰ भ
c c च
C cʰ छ
d d द ɖ ड
D dʰ ध ɖʰ ढ
e ɛ̄ ै ē े
E ẹ̄ ए ɛ̣̄ ऐ
f f \u095E f फ़
g g ग
G gʰ घ
h h ह h̽ ः
i i ि ī ी
I ị इ ị̄ ई
j ɟ ज
J ɟʰ झ
k k क
K kʰ ख
l l ल ɭ ळ
m m म m̽ ं
n n न ɲ ञ ɳ ण
N ŋ ङ ŋ̽ ँ
o ō ो ɔ̄ ौ
O ọ̄ ओ ɔ̣̄ औ
p p प
P pʰ फ
q q \u0958 q क़
r r र ɾ \u095C ɾʰ \u095D ɾ ड़ ɾʰ ढ़
R r̥ ृ r̥̄ ॄ r̥̣ ऋ r̥̣̄ ॠ
s s स ʃ श ʂ ष
t t त ʈ ट
T tʰ थ ʈʰ ठ
u u ु ū ू
U ụ उ ụ̄ ऊ
v ʋ व
x x \u0959 x ख़
y y य ɣ \u095A ɣ ग़
z z \u095B z ज़ ʒ̣ झ़
0 0 ०
1 1 १
2 2 २
3 3 ३
4 4 ४
5 5 ५
6 6 ६
7 7 ७
8 8 ८
9 9 ९
. . ।
* ͓ ्
| ¶ ॥
± ¤ ₹
+ ¨ ॰
\\ ´ ऽ
/ ˑ ़
= ₓ \u200C ₊ \u200D
`
*/

globals.showISOCharMap = ''

var isoCharacterMap = `
a ā ा ai ै au ौ
A a अ ā आ ai ऐ au औ
b b ब
B bh भ
c c च
C ch छ
d d द ḍ ड
D dh ध ḍh ढ
e ē े
E ē ए
f f \u095E
g g ग ġ \u095A
G gh घ
h h ह ḥ ः
i i ि ī ी
I i इ ī ई
j j ज
J jh झ
k k क
K kh ख k͟h \u0959
l l ल ḷ ळ
m m म ṁ ं
n n न ñ ञ ṇ ण
N ṅ ङ ̃ ँ
o ō ो
O ō ओ
p p प
P ph फ
q q \u0958
r r र ṛ \u095C ṛh \u095D
R r̥ ृ r̥̄ ॄ r̥ ऋ r̥̄ ॠ
s s स ś श ṣ ष
t t त ṭ ट
T th थ ṭh ठ
u u ु ū ू
U u उ ū ऊ
v v व
y y य
z z \u095B
0 0 ०
1 1 १
2 2 २
3 3 ३
4 4 ४
5 5 ५
6 6 ६
7 7 ७
8 8 ८
9 9 ९
\\ ' ऽ
`






