globals.showTranslit =  ''
globals.typeAssist = ' ✓'
globals.showKeysTranslitToggle = false



function localInitialise () {

	}



var _h = {
'1B83': ['1B86', '1B89'],
'1B86': ['1B83', '1B89'],
'1B89': ['1B86', '1B83'],
'1B84': ['1B94', '1BB2'],
'1B87': ['1B90', '1B8C'],
'1B8A': ['1B9E'],
'1B8C': ['1B8D', '1B87'],
'1B8D': ['1B8C'],
'1B8E': ['1B96', '1BB8'],
'1B8F': ['1B93'],
'1B93': ['1B8F'],
'1B94': ['1B8D'],
'1B96': ['1B97', '1B95'],
'1B97': ['1B96', '1B96', '1B95'],
'1B95': ['1B96', '1B96', '1B97', '1BBB'],
'1B91': ['1B98'],
'1B98': ['1B91'],
'1B9C': ['1BB7'],
'1BB7': ['1B9C'],
'1B90': ['1B87', '1B85'],
'1B85': ['1BB3', '1BB6'],
'1BB3': ['1B85', '1BB6'],
'1B9E': ['1B9F', '1BB4'],
'1B9D': ['1BB1'],
'1BAF': ['1B9F', '1B9A'],
'1B9F': ['1BAF', '1B9E'],
'1BB8': ['1B8E'],
'1BB9': ['1BB6', '1BB3', '1B85'],
'1BB6': ['1BB9', '1BB3'],
'1BB2': ['1B8D'],
'1BB4': ['1B9E'],
'1CC3': ['1BB0'],
'1BB0': ['1CC3'],
'1BBB': ['1B95'],

end: {}
}


var keyboarddef = [
"§|1|2|3|4|5|6|7|8|9|0|-|=",
"q 𑻲|w 𑻯|e 𑻵|r 𑻭|t 𑻦|y 𑻬|u 𑻴|i 𑻳|o 𑻶|p 𑻣|[|]",
"a 𑻱|s 𑻰|d 𑻧|f|g 𑻡|h|j 𑻪|k 𑻠|l 𑻮|;|'|\\",
"`|z|x|c 𑻩|v|b 𑻤|n 𑻨 𑻢 𑻫|m 𑻥|, 𑻷|. 𑻸|/"
]


var justLatinMap = `
e ə
o ɔ
d ʤ
j ɟ
n ŋ ɲ
t ʧ
`


/*
var translitCharacterMap = `
a a 𑻱
b b 𑻤
c c 𑻩
d d 𑻧
e e 𑻵
g g 𑻡
i i 𑻳
j j 𑻪
k k 𑻠
l l 𑻮
m m 𑻥
n n 𑻨 ɳ 𑻫
N ŋ 𑻢
o o 𑻶
p p 𑻣
r r 𑻭
s s 𑻰
t t 𑻦
u u 𑻴
w w 𑻯
y y 𑻬
. • 𑻷
| ¶ 𑻸
& ˖˖ 𑻲
`
*/



