globals.showLOCTrans = ''
globals.showTransliteration = ''
globals.showIPATrans = ''
globals.typeAssist = ' ✓'
globals.showKeysTranslitToggle = true


function localInitialise () {

	}


var _h = {
"1E928": ["1E936", "1E935", "1E906", "1E91A", "1E914", "1E93C"],
"1E936": ["1E935", "1E906", "1E91A", "1E914", "1E93C", "1E928"],
"1E935": ["1E906", "1E91A", "1E914", "1E93C", "1E928", "1E936"],
"1E906": ["1E91A", "1E914", "1E93C", "1E928", "1E936", "1E935"],
"1E91A": ["1E914", "1E93C", "1E928", "1E936", "1E935", "1E906"],
"1E914": ["1E93C", "1E928", "1E936", "1E935", "1E906", "1E91A"],
"1E93C": ["1E928", "1E936", "1E935", "1E906", "1E91A", "1E914"],
"1E937": ["1E950", "1E92E"],
"1E950": ["1E92E", "1E937"],
"1E92E": ["1E937", "1E950"],
"1E92C": ["1E920", "1E903", "1E959", "1E903", "1E942"],
"1E920": ["1E903", "1E959", "1E903", "1E942", "1E92C"],
"1E903": ["1E959", "1E903", "1E942", "1E92C", "1E920"],
"1E959": ["1E903", "1E942", "1E92C", "1E920", "1E903"],
"1E942": ["1E92C", "1E920", "1E903", "1E959", "1E903"],
"1E940": ["1E91E", "1E929"],
"1E91E": ["1E929", "1E940"],
"1E929": ["1E940", "1E91E"],
"1E926": ["1E904", "1E91F", "1E913", "1E939"],
"1E904": ["1E91F", "1E913", "1E939", "1E926"],
"1E91F": ["1E913", "1E939", "1E926", "1E904"],
"1E913": ["1E939", "1E926", "1E904", "1E91F"],
"1E939": ["1E926", "1E904", "1E91F", "1E913"],
"1E933": ["1E93F", "1E911", "1E921", "1E943"],
"1E93F": ["1E911", "1E921", "1E943", "1E933"],
"1E911": ["1E921", "1E943", "1E933", "1E93F"],
"1E921": ["1E943", "1E933", "1E93F", "1E911"],
"1E943": ["1E933", "1E93F", "1E911", "1E921"],
"1E901": ["1E93A", "1E92A", "1E953", "1E923"],
"1E93A": ["1E92A", "1E953", "1E923", "1E901"],
"1E92A": ["1E953", "1E923", "1E901", "1E93A"],
"1E953": ["1E923", "1E901", "1E93A", "1E92A"],
"1E923": ["1E901", "1E93A", "1E92A", "1E953"],
"1E922": ["1E90D", "1E918", "1E92F"],
"1E90D": ["1E918", "1E92F", "1E922"],
"1E918": ["1E92F", "1E922", "1E90D"],
"1E92F": ["1E922", "1E90D", "1E918"],
"1E916": ["1E924", "1E902", "1E90C", "1E900", "1E938"],
"1E924": ["1E902", "1E90C", "1E900", "1E938", "1E916"],
"1E902": ["1E90C", "1E900", "1E938", "1E916", "1E924"],
"1E90C": ["1E900", "1E938", "1E916", "1E924", "1E902"],
"1E900": ["1E938", "1E916", "1E924", "1E902", "1E90C"],
"1E938": ["1E916", "1E924", "1E902", "1E90C", "1E900"],
"1E954": ["1E90E", "1E930"],
"1E90E": ["1E930", "1E954"],
"1E930": ["1E954", "1E90E"],
"1E93B": ["1E910", "1E919", "1E925"],
"1E910": ["1E919", "1E925", "1E93B"],
"1E919": ["1E925", "1E93B", "1E910"],
"1E925": ["1E93B", "1E910", "1E919"],
"1E93D": ["1E915", "1E91B", "1E92B", "1E909", "1E932"],
"1E915": ["1E91B", "1E92B", "1E909", "1E932", "1E93D"],
"1E91B": ["1E92B", "1E909", "1E932", "1E93D", "1E915"],
"1E92B": ["1E909", "1E932", "1E93D", "1E915", "1E91B"],
"1E909": ["1E932", "1E93D", "1E915", "1E91B", "1E92B"],
"1E932": ["1E93D", "1E915", "1E91B", "1E92B", "1E909"],
"1E931": ["1E91C", "1E90F", "1E93E"],
"1E91C": ["1E90F", "1E93E", "1E931"],
"1E90F": ["1E93E", "1E931", "1E91C"],
"1E93E": ["1E931", "1E91C", "1E90F"],
"1E905": ["1E927"],
"1E927": ["1E905"],
"1E90B": ["1E92D"],
"1E92D": ["1E90B"],
"1E952": ["1E951"],
"1E951": ["1E952"],
end: {}
}

var _hx = {
"c1E928": ["c1E936", "c1E935", "c1E906", "c1E91A", "c1E914", "c1E93C"],
"c1E936": ["c1E935", "c1E906", "c1E91A", "c1E914", "c1E93C", "c1E928"],
"c1E935": ["c1E906", "c1E91A", "c1E914", "c1E93C", "c1E928", "c1E936"],
"c1E906": ["c1E91A", "c1E914", "c1E93C", "c1E928", "c1E936", "c1E935"],
"c1E91A": ["c1E914", "c1E93C", "c1E928", "c1E936", "c1E935", "c1E906"],
"c1E914": ["c1E93C", "c1E928", "c1E936", "c1E935", "c1E906", "c1E91A"],
"c1E93C": ["c1E928", "c1E936", "c1E935", "c1E906", "c1E91A", "c1E914"],
"c1E937": ["c1E950", "c1E92E"],
"c1E950": ["c1E92E", "c1E937"],
"c1E92E": ["c1E937", "c1E950"],
"c1E92C": ["c1E920", "c1E903", "c1E959", "c1E903", "c1E942"],
"c1E920": ["c1E903", "c1E959", "c1E903", "c1E942", "c1E92C"],
"c1E903": ["c1E959", "c1E903", "c1E942", "c1E92C", "c1E920"],
"c1E959": ["c1E903", "c1E942", "c1E92C", "c1E920", "c1E903"],
"c1E942": ["c1E92C", "c1E920", "c1E903", "c1E959", "c1E903"],
"c1E940": ["c1E91E", "c1E929"],
"c1E91E": ["c1E929", "c1E940"],
"c1E929": ["c1E940", "c1E91E"],
"c1E926": ["c1E904", "c1E91F", "c1E913", "c1E939"],
"c1E904": ["c1E91F", "c1E913", "c1E939", "c1E926"],
"c1E91F": ["c1E913", "c1E939", "c1E926", "c1E904"],
"c1E913": ["c1E939", "c1E926", "c1E904", "c1E91F"],
"c1E939": ["c1E926", "c1E904", "c1E91F", "c1E913"],
"c1E933": ["c1E93F", "c1E911", "c1E921", "c1E943"],
"c1E93F": ["c1E911", "c1E921", "c1E943", "c1E933"],
"c1E911": ["c1E921", "c1E943", "c1E933", "c1E93F"],
"c1E921": ["c1E943", "c1E933", "c1E93F", "c1E911"],
"c1E943": ["c1E933", "c1E93F", "c1E911", "c1E921"],
"c1E901": ["c1E93A", "c1E92A", "c1E953", "c1E923"],
"c1E93A": ["c1E92A", "c1E953", "c1E923", "c1E901"],
"c1E92A": ["c1E953", "c1E923", "c1E901", "c1E93A"],
"c1E953": ["c1E923", "c1E901", "c1E93A", "c1E92A"],
"c1E923": ["c1E901", "c1E93A", "c1E92A", "c1E953"],
"c1E922": ["c1E90D", "c1E918", "c1E92F"],
"c1E90D": ["c1E918", "c1E92F", "c1E922"],
"c1E918": ["c1E92F", "c1E922", "c1E90D"],
"c1E92F": ["c1E922", "c1E90D", "c1E918"],
"c1E916": ["c1E924", "c1E902", "c1E90C", "c1E900", "c1E938"],
"c1E924": ["c1E902", "c1E90C", "c1E900", "c1E938", "c1E916"],
"c1E902": ["c1E90C", "c1E900", "c1E938", "c1E916", "c1E924"],
"c1E90C": ["c1E900", "c1E938", "c1E916", "c1E924", "c1E902"],
"c1E900": ["c1E938", "c1E916", "c1E924", "c1E902", "c1E90C"],
"c1E938": ["c1E916", "c1E924", "c1E902", "c1E90C", "c1E900"],
"c1E954": ["c1E90E", "c1E930"],
"c1E90E": ["c1E930", "c1E954"],
"c1E930": ["c1E954", "c1E90E"],
"c1E93B": ["c1E910", "c1E919", "c1E925"],
"c1E910": ["c1E919", "c1E925", "c1E93B"],
"c1E919": ["c1E925", "c1E93B", "c1E910"],
"c1E925": ["c1E93B", "c1E910", "c1E919"],
"c1E93D": ["c1E915", "c1E91B", "c1E92B", "c1E909", "c1E932"],
"c1E915": ["c1E91B", "c1E92B", "c1E909", "c1E932", "c1E93D"],
"c1E91B": ["c1E92B", "c1E909", "c1E932", "c1E93D", "c1E915"],
"c1E92B": ["c1E909", "c1E932", "c1E93D", "c1E915", "c1E91B"],
"c1E909": ["c1E932", "c1E93D", "c1E915", "c1E91B", "c1E92B"],
"c1E932": ["c1E93D", "c1E915", "c1E91B", "c1E92B", "c1E909"],
"c1E931": ["c1E91C", "c1E90F", "c1E93E"],
"c1E91C": ["c1E90F", "c1E93E", "c1E931"],
"c1E90F": ["c1E93E", "c1E931", "c1E91C"],
"c1E93E": ["c1E931", "c1E91C", "c1E90F"],
"c1E905": ["c1E927"],
"c1E927": ["c1E905"],
"c1E90B": ["c1E92D"],
"c1E92D": ["c1E90B"],
"c1E952": ["c1E951"],
"c1E951": ["c1E952"],
end: {}
}


var keyboarddef = [
]



function setLocalButtons () {
	// overrides the function that hides the makeEg and charLink buttons
	
	}






function toggleShift (node) {
	if (node.className =='unshifted') {
		lcs = document.querySelectorAll('.lowercase')
		for (let i=0;i<lcs.length;i++) lcs[i].classList.add('hidden')
		ucs = document.querySelectorAll('.uppercase')
		for (let i=0;i<ucs.length;i++) ucs[i].classList.remove('hidden')
		node.className = 'shifted'
		} 
	else {
		lcs = document.querySelectorAll('.lowercase')
		for (let i=0;i<lcs.length;i++) lcs[i].classList.remove('hidden')
		ucs = document.querySelectorAll('.uppercase')
		for (let i=0;i<ucs.length;i++) ucs[i].classList.add('hidden')
		node.className = 'unshifted'
		}
	}


/*
shapes

𞤼 𞤨 𞤶 𞤵 𞤆 𞤚 𞤔
𞤮 𞤷 𞥐
𞥂 𞤬 𞤠 𞤃 𞥙 𞤃
𞤩 𞥀 𞤞
𞤹 𞤦 𞤄 𞤟 𞤓
𞥃 𞤳 𞤿 𞤑 𞤡
𞤣 𞤁 𞤺 𞤪 𞥓
𞤯 𞤢 𞤍 𞤘
𞤸 𞤖 𞤤 𞤂 𞤌 𞤀
𞤰 𞥔 𞤎
𞤥 𞤻 𞤐 𞤙
𞤲 𞤽 𞤕 𞤛 𞤫 𞤉
𞤾 𞤱 𞤜 𞤏
𞤧 𞤅
𞤭 𞤋
𞥑 𞥒
? 𞥕 𞤴 𞤒 𞥁 𞥖 𞥗 𞥘 𞤗 𞤊 𞤈 𞥟 𞥞
? 𞥆 𞥅 𞥄 𞥈 𞥉 𞥊 𞥇 𞥋
*/



function showAlternatives (className, state) {
	nodes = document.querySelectorAll(className)
	if (state) state = 'inline-block'
	else state = 'none'
	for (let i=0;i<nodes.length;i++) nodes[i].style.display = state
	}


