var _showMesherTrans =  ''
var _showISOTrans = ''


function localInitialise () {
	}
	

var _h = {
'1021': ['1012', '1001'],
'1023': ['1000', '100F'],
'1041': ['101E'],
'1043': ['1025'],
'1051': ['1050', '1040'],
'1050': ['1051', '1040'],
'1040': ['101D', '1050', '1051'],
'1020': ['100B', '100C'],

end: {}
}


var keyboarddef = [
"!,1|@,2|#,3|$,4|%,5|^,6|&,7|*,8|(,9|),0|-,_",
",ˍ|ꓪ,ꓹꓼ|ꓰ,ꓱ|ꓣ,ꓤ|ꓔ,ꓕ|ꓬ,ꓻ|ꓴ,ꓵ|ꓲ,꓾|ꓳ,꓿|ꓑ,ꓒ",
"ꓮ,ꓯ|ꓢ,ꓸꓼ|ꓓ,ꓷ|ꓝ,ꓞ|ꓖ,ꓨ|ꓧ,ꓺ|ꓙ,ꓩ|ꓗ,ꓘ|ꓡ,ꓶ|ꓼ,ꓽ|ʼ,",
"ꓜ,《|ꓫ,》|ꓚ,ꓛ|ꓦ,ꓥ|ꓐ,ꓭ|,ꓠ|ꓟ,…|ꓸꓽ,ꓹꓽ|ꓺꓽ,ꓺꓼ|ꓻꓽ,ꓻꓼ",
]

var keyboardguide = [
"1,2,3,4,5,6,7,8,9,0,-,=",
"q,w,e,r,t,y,u,i,o,p,[,],",
"a,s,d,f,g,h,j,k,l,;,',\\",
"z,x,c,v,b,n,m,,.,/,"
]

var keyboardRowOffset = ['5px','20px','30px','50px']
