globals.showTransliterate = ''
globals.showLatinTrans = ''


function localInitialise () {
	}
	

var _h = {
'1021': ['1012', '1001'],
'1023': ['1000', '100F'],
'1041': ['101E'],
'1043': ['1025'],
'1051': ['1050', '1040'],
'1050': ['1051', '1040'],
'1040': ['101D', '1050', '1051'],
'1020': ['100B', '100C'],

end: {}
}


//var keyboarddef = [
//"!,1|@,2|#,3|$,4|%,5|^,6|&,7|*,8|(,9|),0|-,_",
//",ˍ|ꓪ,ꓹꓼ|ꓰ,ꓱ|ꓣ,ꓤ|ꓔ,ꓕ|ꓬ,ꓻ|ꓴ,ꓵ|ꓲ,꓾|ꓳ,꓿|ꓑ,ꓒ",
//"ꓮ,ꓯ|ꓢ,ꓸꓼ|ꓓ,ꓷ|ꓝ,ꓞ|ꓖ,ꓨ|ꓧ,ꓺ|ꓙ,ꓩ|ꓗ,ꓘ|ꓡ,ꓶ|ꓼ,ꓽ|ʼ,",
//"ꓜ,《|ꓫ,》|ꓚ,ꓛ|ꓦ,ꓥ|ꓐ,ꓭ|,ꓠ|ꓟ,…|ꓸꓽ,ꓹꓽ|ꓺꓽ,ꓺꓼ|ꓻꓽ,ꓻꓼ",
//]

var keyboarddef = [
"§|1|2|3|4|5|6|7|8|9|0|-|=",
"q ˍ|w ꓪ ꓹꓼ|e ꓰ ꓱ|r ꓣ ꓤ|t ꓔ ꓕ|y ꓬ ꓻ|u ꓴ ꓵ|i ꓲ ꓾|o ꓳ ꓿|p ꓑ ꓒ|[|]",
"a ꓮ ꓯ|s ꓢ ꓸꓼ|d ꓓ ꓷ|f ꓝ ꓞ|g ꓖ ꓨ|h ꓧ ꓺ|j ꓙ ꓩ|k ꓗ ꓘ|l ꓡ ꓶ|; ꓼ ꓽ|' ʼ|\\",
"`|z ꓜ 《|x ꓫ 》|c ꓚ ꓛ|v ꓦ ꓥ|b ꓐ ꓭ|n ꓠ|m ꓟ …|, ꓸꓽ ꓹꓽ|. ꓺꓽ ꓺꓼ|/ ꓻꓽ ꓻꓼ"
]
