globals.showLOCTrans = ''
globals.showIPATrans = ''
globals.showTransliteration = ''
globals.typeAssist = ' ✓'
globals.showKeysTranslitToggle = false


window.charCheckerList = [
//{ wrong:"xxx", right:"xxx" },
{ wrong:"ځ", right:"حٔ" },
{ wrong:"ݬ", right:"رٔ" },
{ wrong:"ࢡ", right:"بٔ" },
{ wrong:"ي", right:"ی" },
{ wrong:"ه", right:"ہ" },
{ wrong:"ۀ", right:"ۂ" },
{ wrong:"ة", right:"ۃ" },
{ wrong:"ك", right:"ک" },
{ wrong:"\u0652", right:"\u065B" },
]

// list of fonts to add to the standard selection
window.fontsuggestions =  
`Gulzar
Faiz Lahori Nastaleeq
Nafees Nastaleeq`


function localInitialise () {
	}


var keyboarddef = [
"§|1 ۱|2 ۲|3 ۳|4 ۴|5 ۵|6 ۶|7 ۷ ۖ|8 ۸ ۙ|9 ۹|0 ۰|-|=",
"q ط ظ|w ص ض ً|e ھ ذ َ|r د ڈ ٌ|t ٹ ث|y پ ّ|u ت ۃ|i ب ـ|o  ُج چ|p ح خ ِ|[ ] } َ|] [ { ْ",
"a م ژ ۢ|s و ز|d ر ڑ|f ن ں|g ل ۂ|h ہ ء أ|j ا آ إ|k ک گ|l ی ي|; ؛|' |\\",
"`|z ق \u200D|x ف \u200C|c ے ۓ|v س \u200E|b ش ؤ|n غ ئ|m ع \u200F|. ، >|, ۔ <|/ ؟ "
]





_h = {
'627': ['6F1', '622', '623'],
'6F1': ['622', '623', '627'],
'622': ['623', '627', '6F1'],
'623': ['622', '627', '6F1'],
'628': ['67E', '62A', '679', '62B', '600', '601'],
'67E': ['62A', '679', '62B', '628', '600', '601'],
'62A': ['679', '62B', '628', '67E', '600', '601'],
'679': ['62B', '628', '67E', '62A', '600', '601'],
'62B': ['628', '67E', '62A', '679', '600', '601'],
'62C': ['686', '62D', '62E'],
'686': ['62D', '62E', '62C'],
'62D': ['62E', '62C', '686'],
'62E': ['62C', '686', '62D'],
'62F': ['688', '630', '631', '691', '632', '698', '648', '624'],
'688': ['630', '631', '691', '632', '698', '648', '624', '62F'],
'630': ['631', '691', '632', '698', '648', '624', '62F', '688'],
'631': ['691', '632', '698', '648', '624', '62F', '688', '630'],
'691': ['632', '698', '648', '624', '62F', '688', '630', '631'],
'632': ['698', '648', '624', '62F', '688', '630', '631', '691'],
'698': ['648', '624', '62F', '688', '630', '631', '691', '632'],
'648': ['624', '62F', '688', '630', '631', '691', '632', '698'],
'624': ['62F', '688', '630', '631', '691', '632', '698', '648'],
'633': ['634', '635', '636', '6A9', '646', '6BA'],
'634': ['635', '636', '6A9', '646', '6BA', '633'],
'635': ['636', '6A9', '646', '6BA', '633', '634'],
'636': ['6A9', '646', '6BA', '633', '634', '635'],
'6A9': ['646', '6BA', '633', '634', '635', '636', '6AF', '644'],
'646': ['6BA', '633', '634', '635', '636', '6A9'],
'6BA': ['633', '634', '635', '636', '6A9', '646'],
'637': ['638'],
'638': ['637'],
'639': ['63A', '60F'],
'63A': ['639', '60F'],
'60F': ['639', '63A'],
'641': ['642'],
'642': ['641'],
'6AF': ['6A9', '633', '634', '644'],
'644': ['6A9', '6AF', '633', '646', '6BA'],
'6C1': ['6C2', '6C3', '647'],
'6C2': ['6C3', '647', '6C1'],
'6C0': ['6C3', '647', '6C1', '6C2'],
'6C3': ['647', '6C1', '6C2'],
'647': ['6C1', '6C2', '6C3'],
'6CC': ['626'],
'626': ['6CC'],
'6D2': ['6D3'],
'6D3': ['6D2'],
'602': ['60E'],
'60E': ['602'],
'601': ['600'],
'600': ['601'],

end: {}
}




var locCharacterMap = `
b b ب
B bh بھ
c c چ
C ch چھ
d d د ḍ ڈ
D dh دھ ḍh ڈھ
f f ف
g g گ ǧ غ
G gh گھ g͟h غ
h h ہ h ح
j j ج
J jh جھ
k k ک
K kh کھ k͟h خ
l l ل
m m م
n n ن ṉ ن ṉ ں ṅ ں
p p پ
P ph پھ
q q ق
r r ر ṛ ڑ ṛh ڑھ
s s س s ث s ص ṣ ص s̱ ث š ش sh ش
t t ت t ط t̤ ط ṭ ٹ
T th تھ ṭh ٹھ
v v و
x x خ
y y ی
z z ذ z ز z ض z ظ ẕ ذ z̤ ض ẓ ظ ž ژ zh ژ
' ' ع ' ء
@ ∅ ی ∅ ا ∅ ع ∅ ل ∅ و ∅ ء
a a ا a ہ ā ا ā آ ai ے ai ی ai ای ai ۓ au و au او
e e ے e ی e ای
i i ا i ئ ī ی ī ی ī ای
o o و o او
u u ا ū و ū او
A a َ a اَ a َہ ā ا ā آ ā عَا ai َے ai َی ai اَی ai ۓ au َو au اَو
E e ے e ی e ای e ی
I i اِ ī ی ī ِی ī اِی
O o و o او
U u ُ u اُ u و ū ُو ū اُو ū وٗ ū اوٗ
[ ̃ ں
`



var ipaCharacterMap = `
b b ب β و
B bʰ بھ
c c چ
C cʰ چھ
d d د ɖ ڈ ʤ ج
D dʰ دھ ɖʰ ڈھ ʤʰ جھ
f f ف
g g گ
G gʰ گھ
h h ہ h ح
j j ی
k k ک
K kʰ کھ
l l ل
m m م
n n ن
p p پ
P pʰ پھ
q q ق
r r ر ɽ ڑ ɽʰ ڑھ ʁ غ
s s س s ث s ص ʃ ش
t t ت t ط ʈ ٹ
T tʰ تھ ʈʰ ٹھ
x x خ
z z ذ z ز z ض z ظ ʒ ژ
? ʔ ع
@ ∅ ی ∅ ا ∅ ع ∅ ل ∅ و ∅ ء
e ə ا ɛ ے ɛ ی ɛ ای ɛ ۓ e ے e ی e ای
a ɑː ہ
o ɔ و ɔ او o و o او
i ɪ ائ iː ی iː ای
u ʊ ا uː و uː او
E ə َ ə اَ ɛ َ ɛ َے ɛ َی ɛ اَی ɛ ۓ e ے e ی e ای e ِ
A ɑː َ ɑː ا ɑː آ ɑː عَا
O ɔ َو ɔ اَو o و o او o ُ
I ɪ ِ iː ی iː ِی iː اِی
U ʊ ُ ʊ اُ ʊ و uː ُو uː اُو uː وٗ uː اوٗ
`





function setLocalButtons () {
	// overrides the function that hides the makeEg and charLink buttons
	
	}





