globals.showLOCTrans = ''
globals.showIPATrans = ''
globals.showTransliteration = ''

function localInitialise () {

	}


_characterSet = 
"ئا ا ئە ە ب پ ت ج چ خ د ر ز ژ س ش غ ف ق ك گ ڭ ل م ن ھ ئو و ئۇ ۇ ئۆ ۆ ئۈ ۈ ۋ ئې ې ئى ىي ي ٠ ١ ٢ ٣ ٤ ٥ ٦ ٧ ٨ ٩ ؟ ، ؛"


var _h = {
'627': ['6F1'],
'622': ['6F1'],
'623': ['6F1', '654'],
'625': ['6F1', '655'],
'671': ['6F1'],
'6F1': ['625', '623', '622', '627'],
'60F': ['639', '63A'],
'657': ['64F'],
'620': ['60E'],
'60E': ['602'],
'66B': ['631'],
'631': ['66B'],
'654': ['626', '624', '623'],
'655': ['625'],
'626': ['654'],
'624': ['654'],

end: {}
}



var keyboarddef = [
"§ ÷|1 ۱ !|2 ۲ ٬|3 ۳ ٫|4 ۴ ﷼|5 ۵ ٪|6 ۶ ×|7 ۷ ،|8 ۸ *|9 ۹ )|0 ۰ (|-|=",
"q ض ْ|w ص ٌ|e ث ٍ|r ق ً|t ف ُ|y غ ِ|u ع َ|i ه ّ|o خ ]|p ح [|[ ج }|] چ {",
"a ش  ؤ|s س ئ|d ی ي|f ب إ|g ل أ|h ا آ|j ت ة|k ن «|l م »|; ک :|' گ ؛|\\",
"`|z ظ ك|x ط ٓ|c ز ژ|v ر ٰ|b ذ|n د ٔ|m پ ء|, و|. . |/ ؟"
]


