globals.showTranslit =  ''
globals.typeAssist = ''
globals.showKeysTranslitToggle = false


function localInitialise () {

	}



var _h = {
"C10": ["C1E", "C07"],
"C1E": ["C07", "C10"],
"C07": ["C10", "C1E"],
"C22": ["C09", "C0A", "C21"],
"C09": ["C0A", "C21", "C22"],
"C0A": ["C21", "C22", "C09"],
"C21": ["C22", "C09", "C0A"],
"C0F": ["C2A", "C2B", "C37", "C39", "C2E", "C35", "C0E"],
"C2A": ["C2B", "C37", "C39", "C2E", "C35", "C0E", "C0F"],
"C2B": ["C37", "C39", "C2E", "C35", "C0E", "C0F", "C2A"],
"C37": ["C39", "C2E", "C35", "C0E", "C0F", "C2A", "C2B"],
"C39": ["C2E", "C35", "C0E", "C0F", "C2A", "C2B", "C37"],
"C2E": ["C35", "C0E", "C0F", "C2A", "C2B", "C37", "C39"],
"C35": ["C0E", "C0F", "C2A", "C2B", "C37", "C39", "C2E"],
"C0E": ["C0F", "C2A", "C2B", "C37", "C39", "C2E", "C35"],
"C13": ["C14", "C1C", "C2D", "C19", "C0B", "C60", "C59", "C2C", "C12"],
"C14": ["C1C", "C2D", "C19", "C0B", "C60", "C59", "C2C", "C12", "C13"],
"C1C": ["C2D", "C19", "C0B", "C60", "C59", "C2C", "C12", "C13", "C14"],
"C2D": ["C19", "C0B", "C60", "C59", "C2C", "C12", "C13", "C14", "C1C"],
"C19": ["C0B", "C60", "C59", "C2C", "C12", "C13", "C14", "C1C", "C2D"],
"C0B": ["C60", "C59", "C2C", "C12", "C13", "C14", "C1C", "C2D", "C19"],
"C60": ["C59", "C2C", "C12", "C13", "C14", "C1C", "C2D", "C19", "C0B"],
"C59": ["C2C", "C12", "C13", "C14", "C1C", "C2D", "C19", "C0B", "C60"],
"C2C": ["C12", "C13", "C14", "C1C", "C2D", "C19", "C0B", "C60", "C59",  "C1B", "C58", "C1A"],
"C12": ["C13", "C14", "C1C", "C2D", "C19", "C0B", "C60", "C59", "C2C"],
"C05": ["C24", "C31", "C34", "C06"],
"C24": ["C31", "C34", "C06", "C05"],
"C31": ["C34", "C06", "C05", "C24"],
"C34": ["C06", "C05", "C24", "C31"],
"C06": ["C05", "C24", "C31", "C34"],
"C1F": ["C2C", "C1B", "C58", "C1A"],
"C1B": ["C58", "C1A", "C1F", "C2C"],
"C58": ["C1A", "C1F", "C2C", "C1B"],
"C1A": ["C1F", "C2C", "C1B", "C58"],
"C25": ["C27", "C26"],
"C27": ["C26", "C25"],
"C26": ["C25", "C27"],
"C67": ["C17"],
"C17": ["C67"],
"C1D": ["C30", "C2F", "C02", "C66", "C08", "C20"],
"C30": ["C2F", "C02", "C66", "C08", "C20", "C1D"],
"C2F": ["C02", "C66", "C08", "C20", "C1D", "C30"],
"C02": ["C66", "C08", "C20", "C1D", "C30", "C2F"],
"C66": ["C08", "C20", "C1D", "C30", "C2F", "C02"],
"C08": ["C20", "C1D", "C30", "C2F", "C02", "C66"],
"C20": ["C1D", "C30", "C2F", "C02", "C66", "C08"],
"C28": ["C38"],
"C38": ["C28"],
"C33": ["C36"],
"C36": ["C33"],
"C6F": ["C6C"],
"C6C": ["C6F"],
"C7D": ["C6D", "C3D"],
"C6D": ["C3D", "C7D"],
"C3D": ["C7D", "C6D"],

end: {}
}


var keyboarddef = [
"§ ॊ ऒ|1 १ ऍ|2 २ ॅ ऽ|3 ३ ्र|4 ४ र् ₹|5 ५ ज्ञ|6 ६ त्र|7 ७ क्ष|8 ८ श्र|9 ९ (|0 ० ) ॰|- ः ॢ|= ृ ऋ ॄ",
"q ौ औ|w ै ऐ|e ा आ|r ी ई|t ू ऊ|y ब भ|u ह ङ|i ग घ ग़|o द ध|p ज झ ज़|[ ड ढ ड़|] ़ ञ",
"a ो ओ|s े ए|d ् अ|f ि इ|g ु उ|h प फ|j र ऱ|k क ख क़|l त थ|; च छ|' ट ठ ॑|\\ ॉ ऑ",
"` ॊ ऒ `|z ॆ ऎ|x ं ँ ॐ|c म ण|v न ऩ|b व ऴ|n ल ळ ऌ|m स श|,  ष|. । ॥|/ य य़"
]



globals.showISOCharMap = ''

var isoCharacterMap = `
a ā ा ai ै au ौ
A a अ ā आ ai ऐ au औ
b b ब
B bh भ
c c च
C ch छ
d d द ḍ ड
D dh ध ḍh ढ
e ē े
E ē ए
f f \u095E
g g ग ġ \u095A
G gh घ
h h ह ḥ ः
i i ि ī ी
I i इ ī ई
j j ज
J jh झ
k k क
K kh ख k͟h \u0959
l l ल ḷ ळ
m m म ṁ ं
n n न ñ ञ ṇ ण
N ṅ ङ ̃ ँ
o ō ो
O ō ओ
p p प
P ph फ
q q \u0958
r r र ṛ \u095C ṛh \u095D
R r̥ ृ r̥̄ ॄ r̥ ऋ r̥̄ ॠ
s s स ś श ṣ ष
t t त ṭ ट
T th थ ṭh ठ
u u ु ū ू
U u उ ū ऊ
v v व
y y य
z z \u095B
0 0 ०
1 1 १
2 2 २
3 3 ३
4 4 ४
5 5 ५
6 6 ६
7 7 ७
8 8 ८
9 9 ९
\\ ' ऽ
`






